In [4]:
# loading/ merging files

In [ ]:
#

In [62]:
import pandas as pd
df_city = pd.read_csv("City.csv")
df_cab = pd.read_csv("Cab_Data.csv")
df_transaction = pd.read_csv("Transaction_ID.csv")
df_customer = pd.read_csv("Customer_ID.csv")

In [37]:
#import pandas as pd
#files = ['Cab_Data.csv', 'Transaction_ID.csv', 'City.csv', 'Customer_ID.csv']
#df3 = pd.DataFrame()
#for file in files:
#    data = pd.read_csv(file)
#    df3 = pd.concat([df3, data], axis=0)
#df3.to_csv('merged_files.csv', index=False)

In [47]:
#df_city
#df_cab
df_transaction.shape
#df_customer

(440098, 3)

In [ ]:
# Date of Travel Column (change hours to actual date)

In [63]:
# look at origin later
from datetime import datetime
df_cab['Date of Travel'] = pd.to_datetime(df_cab['Date of Travel'], unit = 'D',
                                                  origin = '1899-12-30')

In [64]:
df_cab

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-08,Pink Cab,ATLANTA GA,30.45,370.95,313.6350
1,10000012,2016-01-06,Pink Cab,ATLANTA GA,28.62,358.52,334.8540
2,10000013,2016-01-02,Pink Cab,ATLANTA GA,9.04,125.20,97.6320
3,10000014,2016-01-07,Pink Cab,ATLANTA GA,33.17,377.40,351.6020
4,10000015,2016-01-03,Pink Cab,ATLANTA GA,8.73,114.62,97.7760
...,...,...,...,...,...,...,...
359387,10440101,2018-01-08,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600
359388,10440104,2018-01-04,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480
359389,10440105,2018-01-05,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500
359390,10440106,2018-01-05,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480
359391,10440107,2018-01-02,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192

In [76]:
#pd.concat([df_cab, df_customer], axis=0)
df_new=pd.merge(df_transaction, df_customer, left_on='Customer ID', right_on='Customer ID')
df_new

,Transaction ID,Customer ID,Payment_Mode,Gender,Age,Income (USD/Month)
0,10000011,29290,Card,Male,28,10813
1,10351127,29290,Cash,Male,28,10813
2,10412921,29290,Card,Male,28,10813
3,10000012,27703,Card,Male,27,9237
4,10320494,27703,Card,Male,27,9237
...,...,...,...,...,...,...
440093,10439799,12490,Cash,Male,33,18713
440094,10439820,14971,Card,Male,30,15346
440095,10439838,41414,Card,Male,38,3960
440096,10439840,41677,Cash,Male,23,19454
440097,10439846,39761,Card,Female,32,10128

In [ ]:
df_new1=pd.merge